# zsh plugins
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

tap "oven-sh/bun"
brew "bun"
brew "go"
brew "pyenv"
brew "pipx"
brew "uv"
brew "xdg-ninja"
brew "stow"
brew "gitleaks"
brew "fzf"
brew "ruff"

# apparently installing python/pyenv with brew doesn't install these and it throw a warning/error so just in case
brew "sqlite"
brew "python-tk"